Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException
Custom exception thrown when the TS version in use is not supported by the structural-data-product.

Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException.MinimumVersion
Gets the minimum supported TS product version.

Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException.RecommendedVersion
Gets the minimum TS product version that is recommended to access latest features.

Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException.CurrentTsVersion
Gets the current TS product version.

Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException class.

Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException class with a specified error message.
message: The message that describes the error.

Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException.#ctor(System.String,System.Exception)
Initializes a new instance of the Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException class with a specified
error message and a reference to the inner exception that is the cause of this exception.
message: The message that describes the error.
innerException: The exception that is the cause of the current exception, or null if no inner exception is specified.

Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException.#ctor(System.String,System.String,System.String)
Creates an instance of the Tekla.Structures.ModelInternal.BimModelDataProduct.UnsupportedTsVersionException class.
currentVersion: Current TS version.
minimumVersion: Minimum TS version required, parsed from the data product.
recommendedVersion: Recommended minimum version to get the latest features, parsed from the data product.